IDEA StatiCa Open Model
RebarBase.RebarShape Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement RebarShape { get; set; }
Public Property RebarShape As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ RebarShape {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
RebarBase Class
IdeaRS.OpenModel.Model Namespace